In [1]:
#We import libraries
import pymysql
import pandas as pd

In [11]:
#We define the conexion. The cell where the password was defined was eliminated
conection = pymysql.connect(host = 'localhost',user = 'root',passwd = password,db='sales')

In [12]:
#We define a cursor object
cursor = conection.cursor()

In [15]:
#We import from the excel file the table that we want to load in the database
sales_channels = pd.read_excel('Tables/CanalDeVenta.xlsx')
sales_channels

   CODIGO DESCRIPCION
0       1  Telefónica
1       2      OnLine
2       3  Presencial

In [17]:
#We translate the names of the columns to english
sales_channels.rename(columns={'CODIGO':'SC_Id','DESCRIPCION':'SC_Description'},inplace=True)
sales_channels

   SC_Id SC_Description
0      1     Telefónica
1      2         OnLine
2      3     Presencial

In [13]:
#We create the sales_channels table
cursor.execute('DROP TABLE IF EXISTS sales_channels;')
cursor.execute('''CREATE TABLE sales_channels(
                            SC_Id TINYINT UNSIGNED NOT NULL,
                            SC_Description VARCHAR(45) DEFAULT NULL);''')

0

In [14]:
#We create the engine to export the data to the database
from sqlalchemy import create_engine
connection_string = 'mysql+pymysql://root:'+password+'@localhost:3306/sales'
engine = create_engine(connection_string)

In [18]:
#We export the data to the database
sales_channels.to_sql(name='sales_channels',con=engine,if_exists='append',index=False)

3

We made the same steps with the other wxcel tables. We import them, we translate them, we create the table in the database and we load them into the database.

In [19]:
#We import the employees table
employees = pd.read_excel('Tables/Empleados.xls')
employees.head()

,ID_empleado,Apellido,Nombre,Sucursal,Sector,Cargo,Salario
0,1968,Burgos,Jeronimo,Caseros,Administración,Administrativo,32000
1,1674,Villegas,Estefania,Caseros,Administración,Vendedor,32000
2,1516,Fernandez,Guillermo,Caseros,Administración,Vendedor,45000
3,1330,Ramirez,Eliana,Caseros,Administración,Vendedor,32000
4,1657,Carmona,Jose,Caseros,Administración,Vendedor,32000

In [20]:
#We translate the fields
employees.rename(columns={'ID_empleado':'Emp_Id','Apellido':'Emp_LastName','Nombre':'Emp_FirstName','Sucursal':'Emp_Branch',
                          'Sector':'Emp_Sector','Cargo':'Emp_Postition','Salario':'Emp_Salary'},inplace=True)
employees.head()

,Emp_Id,Emp_LastName,Emp_FirstName,Emp_Branch,Emp_Sector,Emp_Postition,Emp_Salary
0,1968,Burgos,Jeronimo,Caseros,Administración,Administrativo,32000
1,1674,Villegas,Estefania,Caseros,Administración,Vendedor,32000
2,1516,Fernandez,Guillermo,Caseros,Administración,Vendedor,45000
3,1330,Ramirez,Eliana,Caseros,Administración,Vendedor,32000
4,1657,Carmona,Jose,Caseros,Administración,Vendedor,32000

In [21]:
#We create the table
cursor.execute('DROP TABLE IF EXISTS employees;')
cursor.execute('''CREATE TABLE employees(
                            Emp_Id INT UNSIGNED NOT NULL,
                            Emp_LastName VARCHAR(60) DEFAULT NULL,
                            Emp_FirstName VARCHAR(60) DEFAULT NULL,
                            Emp_Branch VARCHAR(60) DEFAULT NULL,
                            Emp_Sector VARCHAR(60) DEFAULT NULL,
                            Emp_Postition VARCHAR(60) DEFAULT NULL,
                            Emp_Salary INT UNSIGNED DEFAULT NULL);''')

0

In [22]:
#We export the data to the database
employees.to_sql(name='empleados',con=engine,if_exists='append',index=False)

267

Importo con Pandas la tabla de gastos

In [42]:
gasto = pd.read_csv('Homework/Gasto.csv')
gasto.head()

   IdGasto  IdSucursal  IdTipoGasto       Fecha    Monto
0        1          18            1  2015-01-01  1164.90
1        2          18            2  2015-01-01   317.02
2        3          18            3  2015-01-01   118.89
3        4          18            4  2015-01-01  1174.23
4        5           1            1  2015-01-01  1104.51

Creo la tabla de gastos

In [43]:
homework_cursor.execute('''CREATE TABLE gastos(
                            IdGasto INT UNSIGNED NOT NULL,
                            IdSucursal SMALLINT(3) UNSIGNED,
                            IdTipoGasto TINYINT(3) UNSIGNED,
                            Fecha DATE,
                            Monto DECIMAL(10,2));''')

0

Ingreso datos desde DF

In [44]:
gasto.to_sql(name='gastos',con=engine,if_exists='append',index=False)

8640

Importo con Pandas la tabla producto

In [46]:
productos = pd.read_excel('Homework/PRODUCTOS.xlsx')
productos.head()

   ID_PRODUCTO                            Concepto         Tipo   Precio
0        42737                  EPSON COPYFAX 2000    IMPRESIÓN  1658.00
1        42754    MOT ASROCK H110M-HDS S1151 S/VGA  INFORMATICA  1237.50
2        42755  MOT ASROCK A58M-VG3+ AMD FM2+ R2.0  INFORMATICA  1079.32
3        42756                  MOT ECS KAM1-I AM1  INFORMATICA   638.66
4        42757    MOT ASROCK B150M-HDS S1151 S/VGA  INFORMATICA  1784.42

In [51]:
productos.iloc[40:60]

,ID_PRODUCTO,Concepto,Tipo,Precio
40,42793,MEM SD MICRO 64GB KINGSTON CLASE 10 45MB,INFORMATICA,8.718600e+02
41,42794,MEM SD MICRO 16GB SONY CLASE 10,INFORMATICA,3.053600e+02
42,42795,MEM SD MICRO 32GB SONY CLASE 10,INFORMATICA,5.431800e+02
43,42796,MEM SD MICRO 32GB SANDISK CLASE 10,INFORMATICA,4.578200e+02
44,42797,MEM DDR4 16GB 2400MHZ MUSHKIN BLACKLINE,INFORMATICA,4.845500e+03
45,42798,MEM DDR3 8GB 1600MHZ MUSHKIN ESSENTIALS PC,INFORMATICA,1.556280e+03
46,42799,MEM DDR3 8GB 1600MHZ MUSHKIN ESSENTIALS NOTEBOOK,INFORMATICA,1.536040e+03
47,42800,MEM DDR3 8GB 1600MHZ MUSHKIN SILVERLINE,INFORMATICA,1.642740e+03
48,42801,MEM DDR4 8GB 2400MHZ MUSHKIN BLACKLINE,INFORMATICA,2.802800e+03
49,42802,Producto1,NaN,0.000000e+00
50,42803,Producto2,NaN,2.444444e+08
51,42804,Producto3,NaN,2.444444e+08
52,42805,Producto4,NaN,2.444444e+08
53,42806,Producto5,NaN,0.000000e+00
54,42807,Producto6,NaN,0.000000e+00
55,42808,Producto7,NaN,2.444444e+08
56,42809,Producto8,NaN,0.000000e+00
57,42810,CD DVDRW 12X LG BLURAY SATA,GRABACION,1.282820e+03
58,42811,CD DVDRW 8X PIONEER BLURAY SATA USB BLACK,GRABACION,2.559920e+03
59,42812,CD DVD+-RW 24X LG SATA BLACK,GRABACION,3.766400e+02

Creo la tabla productos

In [82]:
homework_cursor.execute('DROP TABLE IF EXISTS productos')
homework_cursor.execute('''CREATE TABLE productos(
                            ID_PRODUCTO INT UNSIGNED NOT NULL,
                            Concepto VARCHAR(100),
                            Tipo VARCHAR(60),
                            Precio VARCHAR(100));''')

0

Completo con datos de Dataframe

In [83]:
productos.to_sql(name='productos',con=engine,if_exists='append',index=False)

291

Importo con Pandas la tabla de proveedores

In [63]:
proveedores = pd.read_excel('Homework/Proveedores.xlsx')
proveedores.head()

,IDProveedor,Nombre,Address,City,State,Country,departamen
0,1,NaN,BEREGUESTEIN 36,AVELLANEDA,BUENOS AIRES,ARGENTINA,AVELLANEDA
1,2,San Cirano,ALBERTI 965,CORONEL BRANDSEN,BUENOS AIRES,ARGENTINA,BRANDSEN
2,3,Bell S.A.,MORENO 331,CAMPANA,BUENOS AIRES,ARGENTINA,CAMPANA
3,4,Rivero Insumos,PTE. PERON 3872,VALENTIN ALSINA,BUENOS AIRES,ARGENTINA,LANUS
4,5,Laprida Computacion,AVDA. PEDRO PEREYRA 1339,LAPRIDA,BUENOS AIRES,ARGENTINA,LAPRIDA

Creo la tabla de proveedores

In [60]:
homework_cursor.execute('''CREATE TABLE proveedores(
                            IDProveedor MEDIUMINT(5) UNSIGNED NOT NULL,
                            Nombre VARCHAR(100),
                            Address VARCHAR(100),
                            City VARCHAR(60),
                            State VARCHAR(60),
                            Country VARCHAR(60),
                            departamen VARCHAR(60));''')

0

Completo con datos de DATAFRAME

In [64]:
proveedores.to_sql(name='proveedores',con=engine,if_exists='append',index=False)

14

Importo con Pandas la tabla Sucursales

In [65]:
sucursales = pd.read_csv('Homework/Sucursales.csv',sep=';',decimal=',')
sucursales.head()

,ID,Sucursal,Direccion,Localidad,Provincia,Latitud,Longitud
0,1,Cabildo,Av. Cabildo 1342,Ciudad de Buenos Aires,Ciudad de Buenos Aires,-34.567806,-58.449572
1,2,Palermo 1,Guatemala 5701,CABA,CABA,-34.579035,-58.433566
2,3,Palermo 2,Gral. Lucio Norberto Mansilla 2668,CABA,C deBuenos Aires,-34.595966,-58.405150
3,4,Corrientes,Av. Corrientes 2352,Ciudad de Buenos Aires,Bs As,-34.604685,-58.398764
4,5,Almagro,Venezuela 3650,Capital,Bs.As.,-34.617308,-58.416179

Creo la tabla Sucursales

In [66]:
homework_cursor.execute('''CREATE TABLE sucursales(
                            ID SMALLINT(3) UNSIGNED NOT NULL,
                            Sucursal VARCHAR(100),
                            Direccion VARCHAR(100),
                            Localidad VARCHAR(60),
                            Provincia VARCHAR(60),
                            Latitud DECIMAL(10,6),
                            Longitud DECIMAL(10,6));''')

0

Completo con datos de DATAFRAME

In [67]:
sucursales.to_sql(name='sucursales',con=engine,if_exists='append',index=False)

31

Importo con Pandas la tabla de tipo de gastos

In [68]:
tiposDeGasto = pd.read_csv('Homework/TiposDeGasto.csv')
tiposDeGasto.head()

   IdTipoGasto         Descripcion  Monto_Aproximado
0            1            Alquiler              1000
1            2           Servicios               300
2            3           Impuestos               100
3            4  Sueldos y Jornales              1000

Creo la tabla tipo de gastos

In [72]:
homework_cursor.execute('DROP TABLE IF EXISTS tipos_de_gastos;')
homework_cursor.execute('''CREATE TABLE tipos_de_gastos(
                            IdTipoGasto TINYINT UNSIGNED NOT NULL,
                            Descripcion VARCHAR(60),
                            Monto_Aproximado INT);''')

0

Completo con datos de DATAFRAME

In [73]:
tiposDeGasto.to_sql(name='tipos_de_gastos',con=engine,if_exists='append',index=False)

4

Importo con Pandas la tabla de venta

In [74]:
venta = pd.read_csv('Homework/Venta.csv')
venta.head()

,IdVenta,Fecha,Fecha_Entrega,IdCanal,IdCliente,IdSucursal,IdEmpleado,IdProducto,Precio,Cantidad
0,1,2018-03-09,2018-03-17,3,969,13,1674,42817,813.12,2.0
1,2,2018-12-28,2018-12-29,2,884,13,1674,42795,543.18,3.0
2,3,2016-03-28,2016-03-31,2,1722,13,1674,42837,430.32,1.0
3,4,2017-10-23,2017-10-24,3,2876,13,1674,42834,818.84,2.0
4,5,2017-11-22,2017-11-25,2,678,13,1674,42825,554.18,3.0

Creo la tabla venta

In [80]:
homework_cursor.execute('DROP TABLE IF EXISTS ventas;')
homework_cursor.execute('''CREATE TABLE ventas(
                            IdVenta INT UNSIGNED NOT NULL,
                            Fecha DATE,
                            Fecha_Entrega DATE,
                            IdCanal TINYINT UNSIGNED,
                            IdCliente INT UNSIGNED,
                            IdSucursal SMALLINT(3) UNSIGNED,
                            IdEmpleado INT UNSIGNED,
                            IdProducto INT UNSIGNED,
                            Precio DECIMAL (10,2),
                            Cantidad INT);''')

0

Completo con datos de DATAFRAME

In [81]:
venta.to_sql(name='ventas',con=engine,if_exists='append',index=False)

46645

2) Es necesario armar un proceso, mediante el cual podamos integrar todas las fuentes, aplicar las transformaciones o reglas de negocio necesarias a los datos y generar el modelo final que va a ser consumido desde los reportes. 
Este proceso debe ser claro y autodocumentado.
¿Se puede armar un esquema, donde sea posible detectar con mayor facilidad futuros errores en los datos?

Se puede. Por ejemplo, asignarle a la cantidad y al precio que sea imposible que sea menor a 0 o que tenga mas de una cantidad de digitos estipulada.